# A common interface for handling tabular data

As we've seen in the FITS tutorial, the [astropy.io.fits](http://docs.astropy.org/en/stable/io/fits/index.html) sub-package can be used to access FITS tables. In addition, as we will see in the next tutorial, there is functionality in [astropy.io.votable](http://docs.astropy.org/en/stable/io/votable/index.html) and [astropy.io.ascii](http://docs.astropy.org/en/stable/io/ascii/index.html) to read in VO and ASCII tables. However, while these sub-pacakges have user interfaces that are specific to each kind of file, it can be difficult to remember all of them. Therefore, astropy includes a higher level interface in [astropy.table](http://docs.astropy.org/en/stable/table/index.html) which can be used to access tables in many different formats in a similar way.


<section class="objectives panel panel-warning">
<div class="panel-heading">
<h2><span class="fa fa-certificate"></span> Objectives</h2>
</div>


<div class="panel-body">

<ul>
<li>Create tables</li>
<li>Access data in tables</li>
<li>Combining tables</li>
<li>Using high-level objects as columns</li>
<li>Aggregation</li>
<li>Masking</li>
<li>Reading/writing</li>
</ul>

</div>

</section>

## Documentation

This notebook only shows a subset of the functionality in astropy.table. For more information about the features presented below as well as other available features, you can read the
[astropy.table documentation](https://docs.astropy.org/en/stable/table/).

In [1]:
%matplotlib inline
import matplotlib.pyplot as plt
plt.rc('image', origin='lower')
plt.rc('figure', figsize=(10, 6))

## Creating tables

The main class we will use here is called ``Table``:

In [2]:
from astropy.table import Table

Before we look at how to read and write tables, let's first see how to create a table from scratch:

In [3]:
t1 = Table()
t1['name'] = ['source1', 'source2', 'source3']
t1['flux'] = [1.1, 1.2, 1.3]

We can look at the table with:

In [4]:
t1

<Table length=3>
  name    flux
  str7  float64
------- -------
source1     1.1
source2     1.2
source3     1.3

We can add columns:

In [6]:
t1['size'] = [1, 5, 4]
t1

<Table length=3>
  name    flux   size
  str7  float64 int64
------- ------- -----
source1     1.1     1
source2     1.2     5
source3     1.3     4

Access the values in a column:

In [7]:
t1['size']

<Column name='size' dtype='int64' length=3>
1
5
4

In [8]:
t1['flux'][1]

1.2

Convert the column to a Numpy array:

In [9]:
import numpy as np
np.array(t1['size'])

array([1, 5, 4])

Access individual cells:

In [10]:
t1['size'][0]

1

And access rows:

In [11]:
t1[0]

<Row index=0>
  name    flux   size
  str7  float64 int64
------- ------- -----
source1     1.1     1

fun quantity things:

In [13]:
t1['size']>1

array([False,  True,  True])

## Units in tables

Table columns can include units:

In [14]:
from astropy import units as u
t1['size'].unit = u.cm
t1['flux'].unit = 'mJy'
t1

<Table length=3>
  name    flux   size
          mJy     cm
  str7  float64 int64
------- ------- -----
source1     1.1     1
source2     1.2     5
source3     1.3     4

Some unitful operations will then work:

In [19]:
t1['size'].to('m')

In [20]:
type(t1['size'].to('m'))

astropy.units.quantity.Quantity

In [21]:
type(t1['size'])

astropy.table.column.Column

However, you may run into unexpected behavior, so if you are planning on using table columns as Quantities, we recommend that you use the ``QTable`` class:

In [22]:
t1

<Table length=3>
  name    flux   size
          mJy     cm
  str7  float64 int64
------- ------- -----
source1     1.1     1
source2     1.2     5
source3     1.3     4

In [23]:
from astropy.table import QTable
qt1 = QTable(t1)

In [24]:
qt1

<QTable length=3>
  name    flux    size
          mJy      cm
  str7  float64 float64
------- ------- -------
source1     1.1     1.0
source2     1.2     5.0
source3     1.3     4.0

In [25]:
type(qt1['size'])

astropy.units.quantity.Quantity


<section class="challenge panel panel-success">
<div class="panel-heading">
<h2><span class="fa fa-pencil"></span> Challenge</h2>
</div>


<div class="panel-body">

<ol>
<li>Make a table that contains three columns: <code>spectral type</code>, <code>temperature</code>, and <code>radius</code>, and incude 5 rows with fake data (or real data if you like, for example from <a href="http://www.atlasoftheuniverse.com/startype.html">here</a>). Try including units on the columns that can have them.</li>
<li>Find the mean temperature and the maximum radius</li>
<li>Try and find out how to add and remove rows</li>
<li>Add a new column which gives the luminosity (using $L=4\pi R^2 \sigma T^4$)</li>
</ol>

</div>

</section>

## Iterating over tables

It is possible to iterate over rows or over columns. To iterate over rows, iterate over the table itself:

In [26]:
for row in t1:
    print(row)

  name  flux size
        mJy   cm
------- ---- ----
source1  1.1    1
  name  flux size
        mJy   cm
------- ---- ----
source2  1.2    5
  name  flux size
        mJy   cm
------- ---- ----
source3  1.3    4

Rows can act like dictionaries, so you can access specific columns from a row:

In [28]:
for row in t1:
    print(row['name'])

source1
source2
source3

Iterating over columns is also easy:

In [31]:
for colname in t1.columns:
    column = t1[colname]
    print(column)

  name
-------
source1
source2
source3
flux
mJy
----
 1.1
 1.2
 1.3
size
 cm
----
   1
   5
   4

Accessing specific rows from a column object can be done with the item notation:

In [33]:
for colname in t1.columns:
    column = t1[colname]
    print(column[0])

source1
1.1
1

You can do this with QTables, too. QTables have extra functionality:

In [34]:
for row in qt1:
    print(row['size'], type(row['size']))

1.0 cm <class 'astropy.units.quantity.Quantity'>
5.0 cm <class 'astropy.units.quantity.Quantity'>
4.0 cm <class 'astropy.units.quantity.Quantity'>

## Joining tables

The astropy.table sub-package provides a few useful functions for stacking/combining tables. For example, we can do a 'join':

add: https://docs.astropy.org/en/stable/table/operations.html#table-operations

In [37]:
t2 = Table()
t2['name'] = ['source1', 'source3']
t2['flux2'] = [1, 9]
t2

<Table length=2>
  name  flux2
  str7  int64
------- -----
source1     1
source3     9

There are lots of ways to do this- vstack, hstack, cstack (different ways to put tables together)

In [38]:
from astropy.table import join

In [39]:
t3 = join(t1, t2, join_type='outer')
t3

<Table length=3>
  name    flux   size flux2
          mJy     cm
  str7  float64 int64 int64
------- ------- ----- -----
source1     1.1     1     1
source2     1.2     5    --
source3     1.3     4     9

In [40]:
np.mean(t3['flux2'])

5.0

## Masked tables

It is possible to mask individual cells in tables:

In [41]:
t4 = Table(masked=True)

In [42]:
t4['id'] = [4, 5, 6]
t4['flux'] = [1.3, 1.5, 1.6]

In [43]:
t4

<Table masked=True length=3>
  id    flux
int64 float64
----- -------
    4     1.3
    5     1.5
    6     1.6

In [44]:
t4['flux'].mask = [1, 0, 1]
t4

<Table masked=True length=3>
  id    flux
int64 float64
----- -------
    4      --
    5     1.5
    6      --

In [45]:
select = np.array([False, True, True])

In [47]:
t5 = t4[select]
t5

<Table masked=True length=2>
  id    flux
int64 float64
----- -------
    5     1.5
    6      --

## Using high-level objects as columns

A few specific astropy high-level objects can be used as columns in table - this includes SkyCoord and Time:

In [48]:
from astropy.time import Time
from astropy.coordinates import SkyCoord

In [49]:
t6 = Table()

In [50]:
t6['time'] = Time([50000, 51000, 52000], format='mjd')

In [51]:
t6['coord'] = SkyCoord([1, 2, 3] * u.deg, [4, 5, 6] * u.deg)

In [52]:
t6['flux'] = [1, 5, 4] * u.mJy

In [53]:
t6

<Table length=3>
  time   coord    flux
        deg,deg   mJy
 object  object float64
------- ------- -------
50000.0 1.0,4.0     1.0
51000.0 2.0,5.0     5.0
52000.0 3.0,6.0     4.0

In [54]:
t6[0]['coord']

<SkyCoord (ICRS): (ra, dec) in deg
    (1., 4.)>

Note however that you may not necessarily be able to write this table to a file and get it back intact, since being able to store this kind of information is not possible in all file formats.

## Slicing

Tables can be sliced like Numpy arrays:

In [55]:
obs = Table(rows=[('M31' , '2012-01-02', 17.0, 17.5),
                  ('M31' , '2012-01-02', 17.1, 17.4),
                  ('M101', '2012-01-02', 15.1, 13.5),
                  ('M82' , '2012-02-14', 16.2, 14.5),
                  ('M31' , '2012-02-14', 16.9, 17.3),
                  ('M82' , '2012-02-14', 15.2, 15.5),
                  ('M101', '2012-02-14', 15.0, 13.6),
                  ('M82' , '2012-03-26', 15.7, 16.5),
                  ('M101', '2012-03-26', 15.1, 13.5),
                  ('M101', '2012-03-26', 14.8, 14.3)],
            names=['name', 'obs_date', 'mag_b', 'mag_v'])

In [56]:
obs

<Table length=10>
name  obs_date   mag_b   mag_v
str4   str10    float64 float64
---- ---------- ------- -------
 M31 2012-01-02    17.0    17.5
 M31 2012-01-02    17.1    17.4
M101 2012-01-02    15.1    13.5
 M82 2012-02-14    16.2    14.5
 M31 2012-02-14    16.9    17.3
 M82 2012-02-14    15.2    15.5
M101 2012-02-14    15.0    13.6
 M82 2012-03-26    15.7    16.5
M101 2012-03-26    15.1    13.5
M101 2012-03-26    14.8    14.3

In [57]:
obs[1:4]

<Table length=3>
name  obs_date   mag_b   mag_v
str4   str10    float64 float64
---- ---------- ------- -------
 M31 2012-01-02    17.1    17.4
M101 2012-01-02    15.1    13.5
 M82 2012-02-14    16.2    14.5

In [58]:
obs[obs['mag_b'] > 15.5]

<Table length=5>
name  obs_date   mag_b   mag_v
str4   str10    float64 float64
---- ---------- ------- -------
 M31 2012-01-02    17.0    17.5
 M31 2012-01-02    17.1    17.4
 M82 2012-02-14    16.2    14.5
 M31 2012-02-14    16.9    17.3
 M82 2012-03-26    15.7    16.5

In [59]:
obs['mag_b', 'mag_v']

<Table length=10>
 mag_b   mag_v
float64 float64
------- -------
   17.0    17.5
   17.1    17.4
   15.1    13.5
   16.2    14.5
   16.9    17.3
   15.2    15.5
   15.0    13.6
   15.7    16.5
   15.1    13.5
   14.8    14.3


<section class="challenge panel panel-success">
<div class="panel-heading">
<h2><span class="fa fa-pencil"></span> Challenge</h2>
</div>


<div class="panel-body">

<p>Starting from the <code>obs</code> table:</p>
<ol>
<li>Make a new table that shows every other row, starting with the second row? (that is, the second, fourth, sixth, etc. rows).</li>
<li>Make a new table the only contains rows where <code>name</code> is <code>M31</code></li>
</ol>

</div>

</section>

## Grouping and Aggregation

It is possible to aggregate rows of a table together - for example, to group the rows by source name in the ``obs`` table, you can do:

In [60]:
obs

<Table length=10>
name  obs_date   mag_b   mag_v
str4   str10    float64 float64
---- ---------- ------- -------
 M31 2012-01-02    17.0    17.5
 M31 2012-01-02    17.1    17.4
M101 2012-01-02    15.1    13.5
 M82 2012-02-14    16.2    14.5
 M31 2012-02-14    16.9    17.3
 M82 2012-02-14    15.2    15.5
M101 2012-02-14    15.0    13.6
 M82 2012-03-26    15.7    16.5
M101 2012-03-26    15.1    13.5
M101 2012-03-26    14.8    14.3

In [61]:
obs_by_name = obs.group_by('name')

In [62]:
obs_by_name

<Table length=10>
name  obs_date   mag_b   mag_v
str4   str10    float64 float64
---- ---------- ------- -------
M101 2012-01-02    15.1    13.5
M101 2012-02-14    15.0    13.6
M101 2012-03-26    15.1    13.5
M101 2012-03-26    14.8    14.3
 M31 2012-01-02    17.0    17.5
 M31 2012-01-02    17.1    17.4
 M31 2012-02-14    16.9    17.3
 M82 2012-02-14    16.2    14.5
 M82 2012-02-14    15.2    15.5
 M82 2012-03-26    15.7    16.5

This is not just sorting the values but actually making it possible to access each group of rows:

In [63]:
for group in obs_by_name.groups:
    print(group)
    print("")

name  obs_date  mag_b mag_v
---- ---------- ----- -----
M101 2012-01-02  15.1  13.5
M101 2012-02-14  15.0  13.6
M101 2012-03-26  15.1  13.5
M101 2012-03-26  14.8  14.3

name  obs_date  mag_b mag_v
---- ---------- ----- -----
 M31 2012-01-02  17.0  17.5
 M31 2012-01-02  17.1  17.4
 M31 2012-02-14  16.9  17.3

name  obs_date  mag_b mag_v
---- ---------- ----- -----
 M82 2012-02-14  16.2  14.5
 M82 2012-02-14  15.2  15.5
 M82 2012-03-26  15.7  16.5

In [64]:
obs_by_name.groups

We can then aggregate the rows together in each group using a function:

In [65]:
obs_by_name.groups.aggregate(np.mean)

WARNING: Cannot aggregate column 'obs_date' with type '<U10' [astropy.table.groups]

<Table length=3>
name       mag_b              mag_v
str4      float64            float64
---- ------------------ ------------------
M101 15.000000000000002 13.725000000000001
 M31               17.0 17.400000000000002
 M82 15.699999999999998               15.5

In [66]:
obs_by_name['name', 'mag_v'].groups.aggregate(np.mean)

<Table length=3>
name       mag_v
str4      float64
---- ------------------
M101 13.725000000000001
 M31 17.400000000000002
 M82               15.5

## Writing data

To write out the data, we can use the ``write`` method:

In [67]:
obs

<Table length=10>
name  obs_date   mag_b   mag_v
str4   str10    float64 float64
---- ---------- ------- -------
 M31 2012-01-02    17.0    17.5
 M31 2012-01-02    17.1    17.4
M101 2012-01-02    15.1    13.5
 M82 2012-02-14    16.2    14.5
 M31 2012-02-14    16.9    17.3
 M82 2012-02-14    15.2    15.5
M101 2012-02-14    15.0    13.6
 M82 2012-03-26    15.7    16.5
M101 2012-03-26    15.1    13.5
M101 2012-03-26    14.8    14.3

In [68]:
obs.write('test.fits')

In [69]:
obs.write('test.tex')

In some cases the format will be inferred from the extension, but only in unambiguous cases - otherwise the format has to be specified explicitly:

In [70]:
obs.write('test.vot', format='votable', overwrite=True)

You can find the [list of supported formats](https://docs.astropy.org/en/stable/io/unified.html#built-in-table-readers-writers) in the documentation.

## Reading data

You can also easily read in tables using the ``read`` method:

In [71]:
t7 = Table.read('data/2mass.tbl', format='ascii.ipac')

In [72]:
Table.read.help('ascii')

========================================
Table.read(format='ascii') documentation
========================================

Read the input ``table`` and return the table.  Most of
the default behavior for various parameters is determined by the Reader
class.

See also:

- https://docs.astropy.org/en/stable/io/ascii/
- https://docs.astropy.org/en/stable/io/ascii/read.html

Parameters
----------
table : str, file-like, list, `pathlib.Path` object
    Input table as a file name, file-like object, list of string[s],
    single newline-separated string or `pathlib.Path` object.
guess : bool
    Try to guess the table format. Defaults to None.
format : str, `~astropy.io.ascii.BaseReader`
    Input table format
Inputter : `~astropy.io.ascii.BaseInputter`
    Inputter class
Outputter : `~astropy.io.ascii.BaseOutputter`
    Outputter class
delimiter : str
    Column delimiter string
comment : str
    Regular expression defining a comment line in table
quotechar : str
    One-character string to quote fields containing special characters
header_start : int
    Line index for the header line not counting comment or blank lines.
    A line with only whitespace is considered blank.
data_start : int
    Line index for the start of data not counting comment or blank lines.
    A line with only whitespace is considered blank.
data_end : int
    Line index for the end of data not counting comment or blank lines.
    This value can be negative to count from the end.
converters : dict
    Dictionary of converters
data_Splitter : `~astropy.io.ascii.BaseSplitter`
    Splitter class to split data columns
header_Splitter : `~astropy.io.ascii.BaseSplitter`
    Splitter class to split header columns
names : list
    List of names corresponding to each data column
include_names : list
    List of names to include in output.
exclude_names : list
    List of names to exclude from output (applied after ``include_names``)
fill_values : tuple, list of tuple
    specification of fill values for bad or missing table values
fill_include_names : list
    List of names to include in fill_values.
fill_exclude_names : list
    List of names to exclude from fill_values (applied after ``fill_include_names``)
fast_reader : bool, str or dict
    Whether to use the C engine, can also be a dict with options which
    defaults to `False`; parameters for options dict:

    use_fast_converter: bool
        enable faster but slightly imprecise floating point conversion method
    parallel: bool or int
        multiprocessing conversion using ``cpu_count()`` or ``'number'`` processes
    exponent_style: str
        One-character string defining the exponent or ``'Fortran'`` to auto-detect
        Fortran-style scientific notation like ``'3.14159D+00'`` (``'E'``, ``'D'``, ``'Q'``),
        all case-insensitive; default ``'E'``, all other imply ``use_fast_converter``
    chunk_size : int
        If supplied with a value > 0 then read the table in chunks of
        approximately ``chunk_size`` bytes. Default is reading table in one pass.
    chunk_generator : bool
        If True and ``chunk_size > 0`` then return an iterator that returns a
        table for each chunk.  The default is to return a single stacked table
        for all the chunks.

encoding : str
    Allow to specify encoding to read the file (default= ``None``).

Returns
-------
dat : `~astropy.table.Table` OR <generator>
    Output table

ASCII reader 'ascii' details
============================

Character-delimited table with a single header line at the top.

Lines beginning with a comment character (default='#') as the first
non-whitespace character are comments.

Example table::

  # Column definition is the first uncommented line
  # Default delimiter is the space character.
  apples oranges pears

  # Data starts after the header column definition, blank lines ignored
  1 2 3
  4 5 6

In [74]:
t8 = Table.read('data/gaia_lmc_psc.fits')

In [75]:
t8

<Table length=1226>
     source_id              ra              ra_error       ...  teff_val a_g_val
       int64             float64            float64        ...  float32  float32
------------------- ----------------- -------------------- ... --------- -------
4650802592000604416 87.07819921385541 0.021177289402850533 ... 4558.4004   0.292
4654524816824470144 74.41054299130985 0.023043629903234147 ... 4297.3867  0.2825
4654529695907256832 74.20814124067418  0.07882566958428994 ...  4637.565     nan
4654557218058933760 73.18224206495864  0.02566576394382618 ...   6255.75   0.132
5279853466498770816 94.44753106184642  0.03057782849457327 ... 5915.3003   0.309
4662917595229314944 73.09902402736357 0.031716989446635716 ... 4978.6665     nan
4662931304765244288 72.79394552845352  0.07339225726421537 ...    5813.5     nan
4662942334232773888 72.43114765425396    1.687482616173613 ... 5095.6333     nan
4662942329938049024 72.43067172359882   0.6134998277695469 ... 5095.6333     nan
4650849699215954816  85.9358409789104 0.019448048806558142 ...  4966.325   0.086
                ...               ...                  ... ...       ...     ...
4661333297749459712 75.76725658539321  0.08021661228698174 ... 5801.6665   0.399
4657284625434796672 83.68286054825961  0.03691085887890347 ...    8782.0  0.6133
4661424527190577920 76.79053200876875 0.020543235240144064 ...   5117.76     nan
4656984252552905600 87.85973994560447 0.029743709298872704 ...   8960.45  0.2753
4657309295660733184 88.71436033931396  0.03263566067977321 ...  6598.033   0.187
4655751970567496064 69.66033697976364 0.021673892097135883 ...   5821.85     nan
4657623137529101824 85.71911145734775  0.02330547812873165 ...  6342.647   0.622
4655429336950537344 72.34317802633602  0.08263071118926058 ...    5951.0     nan
4655428065639154176 71.91821339994686 0.018571231221459143 ...   4844.18     nan
4655436827373195136  72.0678084958562 0.022815560488628858 ...   4564.83   0.617

In [77]:
t9 = Table.read('data/xmm-log.vot')

In [78]:
t9

<Table length=100>
  Obsno     PropDate       Object       RAJ2000  ... FITS XSAlink SASVersion
               s                          deg    ...
  str10      str10         str30        float64  ... str4   str1     str5
---------- ---------- ---------------- --------- ... ---- ------- ----------
0000110101 2002-09-29    XTE J0421+560  64.92542 ... FITS       Y        9.0
0001730101 2004-12-31                         -- ... FITS       N      NOPPS
0001730201 2002-05-25         HD159176 263.67495 ... FITS       Y        9.0
0001730301 2002-05-25         HD159176 263.67495 ... FITS       Y        9.0
0001730401 2002-05-25         HD159176 263.67495 ... FITS       Y        9.0
0001730501 2004-12-31          HD47129  99.34999 ... FITS       Y        9.0
0001730601 2004-12-31          HD47129  99.34999 ... FITS       Y        9.0
0001930101 2002-09-18 IRAS F00235+1024   6.52917 ... FITS       Y        9.0
0001930301 2003-01-16 IRAS F12514+1027 193.50000 ... FITS       Y        9.0
       ...        ...              ...       ... ...  ...     ...        ...
0009221601 2003-10-11            Mrk 3  93.90125 ... FITS       Y        9.0
0009650101 2002-11-02           AO Psc 343.82505 ... FITS       Y        9.0
0009650201 2002-09-20           FO Aqr 334.48125 ... FITS       Y        9.0
0009650301 2002-09-20           FO Aqr 334.48125 ... FITS       Y        9.0
0010420201 2002-10-08       Abell 1644 194.36670 ... FITS       Y        9.0
0010420701 2002-10-08       Abell 1644 194.36670 ... FITS       Y        9.0
0010620101 2003-01-05        V1309 Ori  78.92250 ... FITS       Y        9.0
0011420101 2002-09-19   NGC 2264 north 100.18043 ... FITS       Y        9.0
0011420201 2003-05-10   NGC 2264 south 100.27291 ... FITS       Y        9.0
0011430201 2003-07-04             CTA1   1.75833 ... FITS       Y        9.0


<section class="challenge panel panel-success">
<div class="panel-heading">
<h2><span class="fa fa-pencil"></span> Challenge</h2>
</div>


<div class="panel-body">

<p>Using the <code>t7</code> (2MASS) table above:</p>
<ol>
<li>
<p>Make a plot that shows <code>j_m</code>-<code>h_m</code> on the x-axis, and <code>h_m</code>-<code>k_m</code> on the y-axis</p>
</li>
<li>
<p>Make a new table that contains the subset of rows where the <code>j_snr</code>, <code>h_snr</code>, and <code>k_snr</code> columns, which give the signal-to-noise-ratio in the J, H, and K band, are greater than 10, and try and show these points in red in the plot you just made.</p>
</li>
<li>
<p>Make a new table (based on the full table) that contains only the RA, Dec, and the <code>j_m</code>, <code>h_m</code> and <code>k_m</code> columns, then try and write out this catalog into a format that you can read into another software package. For example, try and write out the catalog into CSV format, then read it into a spreadsheet software package (e.g. Excel, Google Docs, Numbers, OpenOffice). You may run into an issue at this point - if so, take a look at https://github.com/astropy/astropy/issues/7357 to see how to fix it.</p>
</li>
</ol>

</div>

</section>

<center><i>This notebook was written by <a href="https://aperiosoftware.com/">Aperio Software Ltd.</a> &copy; 2019, and is licensed under a <a href="https://creativecommons.org/licenses/by/4.0/">Creative Commons Attribution 4.0 International License (CC BY 4.0)</a></i></center>

![cc](https://mirrors.creativecommons.org/presskit/buttons/88x31/svg/by.svg)